## Plan Result (Managed_Identity_Infrastructure_demo)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_access_policy.managed_identity_access_policy
  * azurerm_user_assigned_identity.managed_identity




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_access_policy.managed_identity_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_user_assigned_identity.managed_identity will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "monitoring-demo-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-demo-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/version-reporter-services"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
          + "startupMode"  = "always"
        }
      + tenant_id           = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":167,"Program":"tfcmt","SHA1":"","Target":"Managed_Identity_Infrastructure_demo","Vars":{}} -->